In [1]:
# Đọc dữ liệu vào DataFrame
import pandas as pd
df=pd.read_csv(filepath_or_buffer = 'FoodPrice_in_Turkey.csv', sep = ',')
df.head()

,Place,ProductId,ProductName,UmId,UmName,Month,Year,Price
0,National Average,52,Rice - Retail,5,KG,5,2013,4.4920
1,National Average,52,Rice - Retail,5,KG,6,2013,4.5786
2,National Average,52,Rice - Retail,5,KG,11,2013,4.7865
3,National Average,52,Rice - Retail,5,KG,12,2013,5.1337
4,National Average,52,Rice - Retail,5,KG,1,2014,5.5099

In [6]:
df.to_excel('demo_FoodPrice.xlsx')
dfxlsx = pd.read_excel('demo_FoodPrice.xlsx')
dfxlsx.head()

,Unnamed: 0,Place,ProductId,ProductName,UmId,UmName,Month,Year,Price
0,0,National Average,52,Rice - Retail,5,KG,5,2013,4.4920
1,1,National Average,52,Rice - Retail,5,KG,6,2013,4.5786
2,2,National Average,52,Rice - Retail,5,KG,11,2013,4.7865
3,3,National Average,52,Rice - Retail,5,KG,12,2013,5.1337
4,4,National Average,52,Rice - Retail,5,KG,1,2014,5.5099

In [13]:
df.to_csv('demo_FoodPrice.csv')
dftest = pd.read_csv('demo_FoodPrice.csv')
dftest.head()

,Unnamed: 0,Place,ProductId,ProductName,UmId,UmName,Month,Year,Price
0,0,National Average,52,Rice - Retail,5,KG,5,2013,4.4920
1,1,National Average,52,Rice - Retail,5,KG,6,2013,4.5786
2,2,National Average,52,Rice - Retail,5,KG,11,2013,4.7865
3,3,National Average,52,Rice - Retail,5,KG,12,2013,5.1337
4,4,National Average,52,Rice - Retail,5,KG,1,2014,5.5099

In [16]:
df.to_json('demo_FoodPrice.json',orient='columns')
dfjson = pd.read_json('demo_FoodPrice.json')
dfjson.head()

,Place,ProductId,ProductName,UmId,UmName,Month,Year,Price
0,National Average,52,Rice - Retail,5,KG,5,2013,4.4920
1,National Average,52,Rice - Retail,5,KG,6,2013,4.5786
2,National Average,52,Rice - Retail,5,KG,11,2013,4.7865
3,National Average,52,Rice - Retail,5,KG,12,2013,5.1337
4,National Average,52,Rice - Retail,5,KG,1,2014,5.5099

In [22]:
df.to_hdf('demo_FoodPrice.h5', key ='table')
dfhdf = pd.read_hdf('demo_FoodPrice.h5',key= 'table')
dfhdf.head()

,Place,ProductId,ProductName,UmId,UmName,Month,Year,Price
0,National Average,52,Rice - Retail,5,KG,5,2013,4.4920
1,National Average,52,Rice - Retail,5,KG,6,2013,4.5786
2,National Average,52,Rice - Retail,5,KG,11,2013,4.7865
3,National Average,52,Rice - Retail,5,KG,12,2013,5.1337
4,National Average,52,Rice - Retail,5,KG,1,2014,5.5099

In [28]:
df.to_html('demo_FoodPrice.html')